### csv 文件

   ```
   't_ads.csv', 't_comment.csv', 't_order.csv', 't_product.csv', 't_sales_sum.csv'
   ```
   
   refer: http://jddjr.jd.com/item/6

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [66]:
data_dir = '/Users/zhaohuizhu/datasets/test_data/jddjr/salesForecast/'
files = os.listdir(data_dir)
files

['Sales_Forecast_Qualification.zip',
 'Sales_Forecast_Upload_Sample.csv',
 't_ads.csv',
 't_comment.csv',
 't_order.csv',
 't_product.csv',
 't_sales_sum.csv']

### t_comment.csv

In [99]:
df = pd.read_csv(os.path.join(data_dir, 't_comment.csv'))

df.head()

    create_dt  bad_num  cmmt_num  dis_num  good_num  mid_num  shop_id
0  2016-08-07        0         2        0         2        0     1494
1  2017-01-10        0        21        0        21        0     1494
2  2017-02-19        0        14        1        14        0     1494
3  2017-03-09        0        14        0        14        0     1494
4  2016-09-13        2       174        0       172        0     1036

In [100]:
df.shape, len(set(df.shop_id))

((636206, 7), 3000)

### t_order.csv

In [101]:
df = pd.read_csv(os.path.join(data_dir, 't_order.csv'))

df.head()

,ord_dt,sale_amt,offer_amt,offer_cnt,shop_id,rtn_cnt,rtn_amt,ord_cnt,pid,user_cnt
0,2016-09-04,19.82,0.0,0,1630,0,0.0,1,41,1
1,2017-01-02,19.82,0.0,0,1630,0,0.0,1,41,1
2,2016-09-23,19.82,0.0,0,1630,0,0.0,1,49,1
3,2016-12-29,19.82,0.0,0,1630,0,0.0,1,49,1
4,2016-08-26,19.82,0.0,0,1630,0,0.0,1,59,1

In [102]:
df.shape, len(set(df.shop_id))

((12098397, 10), 3000)

### t_product.csv

In [103]:
df = pd.read_csv(os.path.join(data_dir, 't_product.csv'))

df.head()

        on_dt off_dt  brand  cate  shop_id  pid
0  2015-10-27    NaN    425   129     1873   11
1  2014-10-16    NaN   2100   264       91   23
2  2015-10-27    NaN    107   238     2107   77
3  2014-08-22    NaN   2100   262       91   99
4  2014-08-22    NaN   2100   262       91  110

In [104]:
df.shape, len(set(df.shop_id))

((11398239, 6), 2886)

## t_sales_sum.csv

In [105]:
df = pd.read_csv(os.path.join(data_dir, 't_sales_sum.csv'))

df.head()

           dt  shop_id  sale_amt_3m
0  2016-12-31     2143     72983.09
1  2016-07-31     2143    106943.03
2  2016-08-31     2143    183723.36
3  2016-09-30     2143    235568.57
4  2016-11-30     2143     80115.29

In [106]:
df.shape, len(set(df.shop_id))

((24030, 3), 3000)

## t_ads.csv

In [107]:
df = pd.read_csv(os.path.join(data_dir, 't_ads.csv'))

df.head()

    create_dt   charge   consume  shop_id
0  2016-08-22      0.0   9110.21     1036
1  2016-08-31      0.0     95.95     1036
2  2016-09-12      0.0   1085.23     1036
3  2016-09-30  65298.6  25096.86     1036
4  2016-12-18      0.0  18974.81     1036

In [108]:
df.shape, len(set(df.shop_id))

((226128, 4), 1951)